PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_cryptolite_aes.h
/***************************************************************************//**
* \file cy_cryptolite_aes.h
* \version 2.80
*
* \brief
*  This file provides common constants and parameters
*  for the Cryptolite AES driver.
*
********************************************************************************
* Copyright 2022 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#if !defined (CY_CRYPTOLITE_AES_H)
#define CY_CRYPTOLITE_AES_H

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTOLITE)

#if defined(__cplusplus)
extern "C" {
#endif

#include "cy_cryptolite_common.h"

#if (CRYPTOLITE_AES_PRESENT == 1)
#if defined(CY_CRYPTOLITE_CFG_AES_C)


/** Defines the Cryptolite AES block size (in bytes) */
/** Only 128 bit key supported **/
#define CY_CRYPTOLITE_AES_BLOCK_SIZE          (16u)

/** Defines the Cryptolite AES_128 key maximum size (in bytes) */
#define CY_CRYPTOLITE_AES_128_KEY_SIZE        (16u)

/** Defines the Cryptolite AES key maximum size (in bytes) */
#define CY_CRYPTOLITE_AES_MAX_KEY_SIZE        (16u)

/** Defines the Cryptolite AES_128 key maximum size (in four-byte words) */
#define CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32    (uint32_t)(CY_CRYPTOLITE_AES_128_KEY_SIZE / 4UL)

/** Defines size of the AES block, in four-byte words */
#define CY_CRYPTOLITE_AES_BLOCK_SIZE_U32      (uint32_t)(CY_CRYPTOLITE_AES_BLOCK_SIZE / 4UL)

#define CY_CRYPTO_AES_CTR_CNT_POS          (0x02U)

/**
* \addtogroup group_cryptolite_data_structures
* \{
*/
/* The structure to define used memory buffers */
typedef struct
{
    /** \cond INTERNAL */
    CY_ALIGN(4) uint32_t key[CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32];

    CY_ALIGN(4) uint32_t src[CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32];
    CY_ALIGN(4) uint32_t dst[CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32];

#if defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CBC) || defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CFB) || defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CTR)
    CY_ALIGN(4) uint32_t block0[CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32];
#endif

#if defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CFB) || defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CTR)
    CY_ALIGN(4) uint32_t block1[CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32];
#endif

#if defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CTR)
    CY_ALIGN(4) uint32_t block2[CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32];
    CY_ALIGN(4) uint32_t block3[CY_CRYPTOLITE_AES_MAX_KEY_SIZE_U32];
#endif

    CY_ALIGN(4) uint8_t unProcessedData[CY_CRYPTOLITE_AES_BLOCK_SIZE];
    CY_ALIGN(4) uint8_t iv[CY_CRYPTOLITE_AES_BLOCK_SIZE];

#if defined (CY_CRYPTOLITE_CFG_CIPHER_MODE_CBC)
    CY_ALIGN(4) uint8_t temp[CY_CRYPTOLITE_AES_BLOCK_SIZE];
#endif

    /*Assigned dummy byte for the 4 byte alignment*/
    CY_ALIGN(4) uint32_t dummy[1u];
    /** \endcond */
} cy_stc_cryptolite_aes_buffers_t;




/* The structure to define used memory buffers */
typedef struct
{
    /** \cond INTERNAL */
    cy_stc_cryptolite_aes_buffers_t aesCbcMac_buffer;
    cy_stc_cryptolite_aes_buffers_t aesCtr_buffer;
    CY_ALIGN(4) uint8_t temp_buffer[CY_CRYPTOLITE_AES_BLOCK_SIZE];
    CY_ALIGN(4) uint8_t ctr[CY_CRYPTOLITE_AES_BLOCK_SIZE];
    CY_ALIGN(4) uint8_t y[CY_CRYPTOLITE_AES_BLOCK_SIZE];

    /** \endcond */
} cy_stc_cryptolite_aes_ccm_buffers_t;

/** \cond INTERNAL */
/** The cryptolite AES128 IP descriptor structure.
* All fields for the structure are internal. Firmware never reads or
* writes these values.
*/
typedef struct
{
    uint32_t key;
    uint32_t plainText;
    uint32_t cipherText;
} cy_stc_cryptolite_aes_descr_t;
/** \endcond */

/** The structure for storing the AES context.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct
{
    /** \cond INTERNAL */
    /** AES state data */
    /** Pointer to AES work buffers */
    cy_stc_cryptolite_aes_buffers_t *buffers;
    /** Operation data descriptors */
    cy_stc_cryptolite_aes_descr_t message_encrypt_struct;
    /** AES unprocessed message block*/
    uint32_t unProcessedBytes;
    /** AES ivSize*/
    uint16_t ivSize;
    /** Is MAC*/
    bool isMac;
    /** AES mode*/
    cy_en_cryptolite_dir_mode_t dirMode;
    /** \endcond */
} cy_stc_cryptolite_aes_state_t;

typedef struct
{
    /** \cond INTERNAL */
    /** AES state data */
    cy_en_cryptolite_dir_mode_t dirMode;
    /** Pointer to AES work buffers */
    cy_stc_cryptolite_aes_state_t aesCbcMacState;
    /** Operation data descriptors */
    cy_stc_cryptolite_aes_state_t aesCtrState;
    /** pointer to temp buffer */
    uint8_t *temp;
    /** pointer to ctr buffer */
    uint8_t *ctr;
    /** pointer to y buffer */
    uint8_t *y;
    /** Length field Size*/
    uint32_t L;
    /** Total text size*/
    uint32_t textLength;
    /** Total AAD size*/
    uint32_t aadLength;
    /** Total tag size*/
    uint8_t tagLength;
    /** AAD size processed*/
    uint32_t aadLengthProcessed;
    /** AAD processed flag*/
    bool isAadProcessed;
    /** IV set flag*/
    bool isIvSet;
    /** Length Set flag*/
    bool isLengthSet;
    /** \endcond */
} cy_stc_cryptolite_aes_ccm_state_t;

/** \} group_cryptolite_data_structures */


/**
* \addtogroup group_cryptolite_lld_aes_functions
* \{
*/

